/*******************************************************************************
* Copyright (c) 2017 Intel Corporation
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*      http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "vmm_base.h"
#include "gcpu.h"
#include "isr.h"
#include "gcpu_inject_event.h"
#include "hmm.h"
#include "vmexit_cr_access.h"
#include "vmm_arch.h"
#include "vmx_cap.h"
#include "guest.h"

#include "lib/util.h"

#include "modules/vmexit_task_switch.h"

/* This is 32-bit TSS. */

typedef struct {
	uint32_t	prev_tr;        /* 0 */
	uint32_t	esp0;           /* 4 */
	uint32_t	ss0;            /* 8 */
	uint32_t	esp1;           /* 12 */
	uint32_t	ss1;            /* 16 */
	uint32_t	esp2;           /* 20 */
	uint32_t	ss2;            /* 24 */
	uint32_t	cr3;            /* 28 */
	uint32_t	eip;            /* 32 */
	uint32_t	eflags;         /* 36 */
	uint32_t	eax;            /* 40 */
	uint32_t	ecx;            /* 44 */
	uint32_t	edx;            /* 48 */
	uint32_t	ebx;            /* 52 */
	uint32_t	esp;            /* 56 */
	uint32_t	ebp;            /* 60 */
	uint32_t	esi;            /* 64 */
	uint32_t	edi;            /* 68 */
	uint32_t	es;             /* 72 */
	uint32_t	cs;             /* 76 */
	uint32_t	ss;             /* 80 */
	uint32_t	ds;             /* 84 */
	uint32_t	fs;             /* 88 */
	uint32_t	gs;             /* 92 */
	uint32_t	ldtr;           /* 96 */
	uint32_t	io_base_addr;   /* 100 */
} tss32_t;

#define DR7_L0   (1u << 0)
#define DR7_L1   (1u << 2)
#define DR7_L2   (1u << 4)
#define DR7_L3   (1u << 6)

#define IS_SOFTWARE_VECTOR(vec) \
	( \
		((vec.bits.interrupt_type == \
		  VECTOR_TYPE_SW_INT) || \
		 (vec.bits.interrupt_type == \
		  VECTOR_TYPE_PRI_SW_INT) || \
		 (vec.bits.interrupt_type == \
		  VECTOR_TYPE_SW_EXCEPTION) \
		) \
	)

/* Two-byte padding after selector is ok. */
typedef struct {
	uint16_t	selector;
	uint32_t	base;
	uint32_t	limit;
	seg_ar_t	ar;
} seg_reg_t;

typedef union {
	uint64_t value;
	struct {
		uint32_t limit_15_00:16;       /* bits 15:0 */
		uint32_t base_15_00:16;        /* bits 31:16 */
		uint32_t base_23_16:8;         /* bits 39:32 */
		uint32_t type:4;               /* bits 43:40 */
		uint32_t s_bit:1;              /* bit 44 */
		uint32_t dpl:2;                /* bit2 46:45 */
		uint32_t p_bit:1;              /* bit 47 */
		uint32_t limit_19_16:4;        /* bits 51:48 */
